GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
/*
   SIM卡的IMSI号码为4600 00783208249，
      460 00 18 23 20 86 42

   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t pt_resp_CIMI( char *p, uint16_t len )
{
	char *pimsi, i;

	rt_kprintf( "cimi len=%d\n", len );
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CGSN**/
rt_err_t pt_resp_CGSN( char *p, uint16_t len )
{
	char	*pimsi, i;
	char	*pstr;
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CPIN*/
rt_err_t pt_resp_CPIN( char *p, uint16_t len )
{
	char *pstr = RT_NULL;
	pstr = strstr( p, "+CPIN: READY" ); //+CPIN: READY
	if( pstr )
	{
		return RT_EOK;                  /*找到了*/
	}
	return RT_ERROR;
}

/* +CSQ: 31, 99 */
rt_err_t pt_resp_CSQ( char *p, uint16_t len )
{
	rt_err_t	res = RT_ERROR;
	uint32_t	i, n, code;
	i = sscanf( p, "+CSQ%*[^:]:%d,%d", &n, &code );
	if( i != 2 )
	{
		return RT_ERROR;
	}
	gsm_param.csq = n;
	return RT_EOK;
}

/*+CGATT:1*/
rt_err_t pt_resp_CGATT( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "+CGATT: 1" );
	if( pfind )
	{
		return RT_EOK;
	}
	return RT_ERROR;
}


/*%ETCPIP:1,"10.24.44.142","0.0.0.0","0.0.0.0"*/
rt_err_t pt_resp_ETCPIP( char *p, uint16_t len )
{
	rt_err_t	res = RT_ERROR;
	uint8_t stage=0;
	char *psrc=p;
	char *pdst=gsm_param.ip;

	while(1)
	{
		if(stage==0)
		{
			if(*psrc=='"') stage=1;
			psrc++;
		}
		else
		{
			if(*psrc=='"') break;
			*pdst=*psrc;
			pdst++;
			psrc++;
		}
	}
	rt_kprintf("ip=%s\r\n",gsm_param.ip);
	return RT_EOK;
}


/*通用检查函数，看是否收到数据，如果有数据后再判断*/
rt_err_t pt_resp( RESP_FUNC func )
{
	char		*pstr;
	uint16_t	len;
	rt_err_t	ret;
	ret = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pstr, 0 );
	if( ret == -RT_ETIMEOUT )
	{
		return RT_ETIMEOUT;
	}
/*有应答，执行相应的函数*/
	len = ( ( *pstr ) << 8 ) | ( *( pstr + 1 ) );
	ret = func( pstr + 2, len );
	rt_kprintf( "pt_resp ret=%x\r\n", ret );
	rt_free( pstr );
	return ret;
}

typedef rt_err_t ( *AT_RESP )( char *p, uint16_t len );
typedef struct
{
	char		*atcmd;
	AT_RESP		resp;
	uint16_t	timeout;
	uint16_t	retry;
}AT_CMD_RESP;

/*gsm供电的处理纤程*/
static int protothread_gsm_power( struct pt *pt )
{
	static AT_CMD_RESP	at_init[] =
	{
		{ RT_NULL,		   pt_resp_STR_OK, RT_TICK_PER_SECOND * 10, 1  },
		{ RT_NULL,		   pt_resp_STR_OK, RT_TICK_PER_SECOND * 10, 1  },
		{ "ATE0\r\n",	   pt_resp_STR_OK, RT_TICK_PER_SECOND * 3,	1  },
		{ "ATV1\r\n",	   pt_resp_STR_OK, RT_TICK_PER_SECOND * 3,	1  },
		{ "AT+CPIN?\r\n",  pt_resp_CPIN,   RT_TICK_PER_SECOND * 3,	1 },
		{ "AT+CREG?\r\n",  pt_resp_CGREG,  RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CIMI\r\n",   pt_resp_CIMI,   RT_TICK_PER_SECOND * 3,	1  },
		{ "AT+CGREG?\r\n", pt_resp_CGREG,  RT_TICK_PER_SECOND * 3,	10 },
		{ "AT+CGATT?\r\n", pt_resp_CGATT,  RT_TICK_PER_SECOND * 3,	10 },
	};
	static struct timer timer_gsm_power;
	static uint8_t		at_init_index	= 0;
	static uint8_t		at_init_retry	= 0;
	rt_err_t			ret;

	PT_BEGIN( pt );
	if( gsm_state == GSM_POWERON )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		timer_set( &timer_gsm_power, 200 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_power ) );
		GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );

		for( at_init_index = 0; at_init_index < sizeof( at_init ) / sizeof( AT_CMD_RESP ); at_init_index++ )
		{
			for( at_init_retry = 0; at_init_retry < at_init[at_init_index].retry; at_init_retry++ )
			{
				if( at_init[at_init_index].atcmd != RT_NULL )
				{
					rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), at_init[at_init_index].atcmd );
					m66_write( &dev_gsm, 0, at_init[at_init_index].atcmd, strlen( at_init[at_init_index].atcmd ) );
				}
				timer_set( &timer_gsm_power, at_init[at_init_index].timeout );
				PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( at_init[at_init_index].resp ) ) );
				if( timer_expired( &timer_gsm_power ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
					PT_EXIT(pt);
				}else
				{
					break;
				}
			}
		}
		gsm_state = GSM_AT; /*切换到AT状态*/
		socket_state=SOCKET_INIT;
	}
	if( gsm_state == GSM_POWEROFF )
	{
	}
	PT_END( pt );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static int protothread_gsm_socket( struct pt *pt )
{
	/*线程状态处理,可以yield*/
	char				buf[64];

	static struct timer timer_gsm_tcpip;



	PT_BEGIN( pt );
	if(socket_state == SOCKET_INIT)
	{
/*没有使用类似at_init的方式，使用结构数组判读，而是直接按顺序做*/

		sprintf(buf,"AT+CGDCONT=1,\"IP\",\"%s\"\r\n",jt808_param.apn);
		rt_kprintf( "gsm_send>%s", buf );
		m66_write( &dev_gsm, 0, buf, strlen( buf ) );
		timer_set( &timer_gsm_tcpip, RT_TICK_PER_SECOND * 5 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( pt_resp_STR_OK ) ) );
		if( timer_expired( &timer_gsm_tcpip ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			PT_EXIT(pt);
		}

		sprintf(buf,"AT%%ETCPIP=1,\"%s\",\"%s\"\r\n",jt808_param.user,jt808_param.psw);
		rt_kprintf( "gsm_send>%s", buf );
		m66_write( &dev_gsm, 0, buf, strlen( buf ) );
		timer_set( &timer_gsm_tcpip, RT_TICK_PER_SECOND * 30 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( pt_resp_STR_OK ) ) );
		if( timer_expired( &timer_gsm_tcpip ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			PT_EXIT(pt);
		}

		sprintf(buf,"AT%%ETCPIP?\r\n");
		rt_kprintf( "gsm_send>%s", buf );
		m66_write( &dev_gsm, 0, buf, strlen( buf ) );
		timer_set( &timer_gsm_tcpip, RT_TICK_PER_SECOND * 30 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( pt_resp_ETCPIP ) ) );
		if( timer_expired( &timer_gsm_tcpip ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			PT_EXIT(pt);
		}

		sprintf(buf,"AT%%IOMODE=1,2,1\r\n");
		rt_kprintf( "gsm_send>%s", buf );
		m66_write( &dev_gsm, 0, buf, strlen( buf ) );
		timer_set( &timer_gsm_tcpip, RT_TICK_PER_SECOND * 30 );
		PT_WAIT_UNTIL( pt, timer_expired( &timer_gsm_tcpip ) || ( RT_EOK == pt_resp( pt_resp_STR_OK ) ) );
		if( timer_expired( &timer_gsm_tcpip ) ) /*超时*/
		{
			rt_kprintf( "timeout\r\n" );
			PT_EXIT(pt);
		}

